** It's a race!
#+begin_src emacs-lisp
  (defun elg:get-data-org-map ()
    "Testing function." 
    (-non-nil
     (org-map-entries #'elg--parser
                      nil
                      (-list elg:agenda-files)
                      elg:skip-files)))

  (defun elg:get-data-org-ql ()
    "Testing function."
    (-non-nil
     (org-ql-select elg:agenda-files
       '(and (ts)
             (not (tags "ARCHIVE")))
       :action #'elg--parser)))

  (defun elg:get-data-org-map-pre ()
    "Testing function." 
    (-non-nil
     (org-map-entries (lambda () (-let (((&alist "TIMESTAMP" elg-timestamp
                                                 "TIMESTAMP_IA" elg-timestamp-ia
                                                 "DEADLINE" elg-deadline
                                                 "SCHEDULED" elg-scheduled)
                                         (org-entry-properties)))
                                   (when (or elg-timestamp
                                             elg-timestamp-ia
                                             elg-deadline
                                             elg-scheduled)
                                     (elg--parser))))
                      nil
                      (-list elg:agenda-files)
                      elg:skip-files)))

  (defun elg:get-data-org-map-pre* ()
    "Testing function." 
    (-non-nil
     (org-map-entries (lambda ()
                        (let ((props (org-entry-properties)))
                          (when (or (alist-get "TIMESTAMP" props nil nil #'string=)
                                    (alist-get "TIMESTAMP_IA" props nil nil #'string=)
                                    (alist-get "DEADLINE" props nil nil #'string=)
                                    (alist-get "SCHEDULED" props nil nil #'string=))
                            (elg--parser))))
                      nil
                      (-list elg:agenda-files)
                      elg:skip-files)))

  (bench-multi :times 100 :ensure-equal t
    :forms (("org-map" (elg:get-data-org-map))
            ("org-map-preprocess" (elg:get-data-org-map-pre))
            ("org-map-preprocess*" (elg:get-data-org-map-pre*))
            ("org-ql" (elg:get-data-org-ql))))
#+end_src

#+RESULTS:
| Form                | x faster than next | Total runtime | # of GCs | Total GC runtime |
|---------------------+--------------------+---------------+----------+------------------|
| org-ql              |              14.94 |      0.134995 |        1 |         0.058762 |
| org-map-preprocess* |               1.19 |      2.017357 |       15 |         0.951616 |
| org-map-preprocess  |               1.04 |      2.403705 |       20 |         1.184456 |
| org-map             |            slowest |      2.490510 |       21 |         1.261543 |

